In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Combining & Merging

In [6]:
# pd.merge(left, right, on)
# pd.concat([df1, df2], axis=[0/1], join=['outer'/'inner'], sort=[true/false])

In [53]:
df1 = pd.DataFrame({'Branch':['MCA', 'MBA', 'CSE', 'CST'],
                    'Names':['Nagendra', 'Nanda', 'Naveen', 'Rama Mohan'],
                   'Code': ['1F', '1E', '1A', '1B']}, index=['96', '98', 'A6', 'C8'])
df2 = pd.DataFrame({'Department':['Computer Applications',
                                 'Computer Science', 'Computer Technology'],
                   'Hod': ['Naveen', 'Suresh', 'Ramesh'],
                   'Code': ['1F', '1A', '1B']})
df3 = pd.DataFrame({'Department':['Computer Applications',
                                 'Computer Science', 'Computer Technology'],
                   'Hod': ['Naveen', 'Suresh', 'Ramesh']},
                   index= ['1F', '1A', '1B'])

In [54]:
df1

   Branch       Names Code
96    MCA    Nagendra   1F
98    MBA       Nanda   1E
A6    CSE      Naveen   1A
C8    CST  Rama Mohan   1B

In [55]:
df2

              Department     Hod Code
0  Computer Applications  Naveen   1F
1       Computer Science  Suresh   1A
2    Computer Technology  Ramesh   1B

In [56]:
pd.merge(df1, df2)

  Branch       Names Code             Department     Hod
0    MCA    Nagendra   1F  Computer Applications  Naveen
1    CSE      Naveen   1A       Computer Science  Suresh
2    CST  Rama Mohan   1B    Computer Technology  Ramesh

In [57]:
pd.merge(df1, df2, on='Code')

  Branch       Names Code             Department     Hod
0    MCA    Nagendra   1F  Computer Applications  Naveen
1    CSE      Naveen   1A       Computer Science  Suresh
2    CST  Rama Mohan   1B    Computer Technology  Ramesh

In [58]:
pd.merge(left=df1, right=df2, on='Code', how='outer')

  Branch       Names Code             Department     Hod
0    CSE      Naveen   1A       Computer Science  Suresh
1    CST  Rama Mohan   1B    Computer Technology  Ramesh
2    MBA       Nanda   1E                    NaN     NaN
3    MCA    Nagendra   1F  Computer Applications  Naveen

In [59]:
pd.merge(df1, df3, left_on='Code', right_index=True, how='right')

   Branch       Names Code             Department     Hod
96    MCA    Nagendra   1F  Computer Applications  Naveen
A6    CSE      Naveen   1A       Computer Science  Suresh
C8    CST  Rama Mohan   1B    Computer Technology  Ramesh